---
kind: method
id: M:Autodesk.Revit.DB.ViewSheet.DeleteViewport(Autodesk.Revit.DB.Viewport)
zh: 图纸
source: html/23892aae-d0f3-52c9-5bc7-ee9002d43e87.htm
---
# Autodesk.Revit.DB.ViewSheet.DeleteViewport Method

**中文**: 图纸

Removes a viewport from the sheet by deleting it from the document.

## Syntax (C#)
```csharp
public void DeleteViewport(
	Viewport viewport
)
```

## Parameters
- **viewport** (`Autodesk.Revit.DB.Viewport`) - The viewport that will be deleted and removed from the sheet.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null